<?php
use think\facade\Env;

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 默认缓存驱动
    'default'   => 'redis',
    // 缓存连接方式配置
    'stores'    => [
        'redis' => [
            // 驱动方式
            'type'   => 'redis',
            // 服务器地址
            'host'   => '127.0.0.1',
            // 端口
            'port'   => 6379,
            // 密码
            'password' => 'Admin887572*',
            // 选取哪个数据库
            'select' => 0,
            // 连接超时时间（秒）
            'timeout' => 0,
            // 持久连接
            'persistent' => false,
            // 前缀
            'prefix'     => '',
            // 连接参数
            'options'    => [],
        ],
    ],
];